#include <iostream>
using namespace std;
#include <chrono>
using namespace std::chrono; // Для добавления секунд.
#include <thread>
using namespace std::this_thread; // sleep_for, sleep_until.
//-------------------------------------------------------------------------------------------------------------------------
//-------------------------------------------------------------------------------------------------------------------------
//-------------------------------------------------------------------------------------------------------------------------

struct Pipe // Данные о трубе. Нужно для записи данных в файл.
{
    string pipe_name = "Nothing";
    double pipe_length = 0.0;
    int pipe_diameter = 0;
    bool pipe_repair = false; //  режим работы (в ремонте)
};
struct Station //Данные о КС
{
    string station_name = "Nothing";
    int station_workshops = 0;
    int station_working_workshops = 0;
    double station_efficiency = 0.0;
};
//-------------------------------------------------------------------------------------------------------------------------
//-------------------------------------------------------------------------------------------------------------------------
//-------------------------------------------------------------------------------------------------------------------------
Pipe Adding_a_pipe() //1. Добавить трубу
{
    Pipe new_pipe; // Берём шаблон сверху и начинаем творить чудеса...
    setlocale(LC_ALL, "Russian");
    cout << "-------------------------------------------------------------------------------------------------------" << endl;
    cout << "Добавляем трубу" << endl;
    cout << "-------------------------------------------------------------------------------------------------------" << endl;
    sleep_for(seconds(1));
    cout << "Назовите свою трубу (на инглише, по русски программа понимать не хочет...): ";
    cin >> new_pipe.pipe_name;
    cout << "Укажите длину трубы: ";
    cin >> new_pipe.pipe_length;
    cout << "Укажите диаметр трубы: ";
    cin >> new_pipe.pipe_diameter;
    new_pipe.pipe_repair = false;
    return new_pipe;
}//-------------------------------------------------------------------------------------------------------------------------

 Station Adding_a_compressor_station() { //2. Добавить КС 
     setlocale(LC_ALL, "Russian");
     Station new_station;
     cout << "-----------------------------------------------------------------------------------------------------------------------" << endl;
     cout << "Добавляем КС:" << endl;
     cout << "-----------------------------------------------------------------------------------------------------------------------" << endl;
     sleep_for(seconds(1));
     cout << "Назовите свою КС: ";
     cin >> new_station.station_name;
     cout << "Укажите количество цехов: ";
     cin >> new_station.station_workshops;
     cout << "Укажите количество РАБОЧИХ цехов: ";
     cin >> new_station.station_working_workshops;
     cout << "Укажите эффективность КС: ";
     cin >> new_station.station_efficiency;
     return new_station;
}
//-------------------------------------------------------------------------------------------------------------------------

void pipe_info(Pipe new_pipe) { //3. Просмотр всех объектов
    cout << "-----------------------------------------------------------------------------------------------------------------------" << endl;
    cout << "Информация о вашей трубе:" << endl;
    cout << "-----------------------------------------------------------------------------------------------------------------------" << endl;
    sleep_for(seconds(1));
    if (new_pipe.pipe_name == "Nothing") {
        cout << "Отсутствуют..." << endl;
    }
    else {
        cout << "Имя: " << new_pipe.pipe_name << endl;
        cout << "Длина: " << new_pipe.pipe_length << " метров."<< endl;
        cout << "Диаметр: " << new_pipe.pipe_diameter << " миллиметров." << endl;
    }
    sleep_for(seconds(1));
    cout << "-----------------------------------------------------------------------------------------------------------------------" << endl;
}

void station_info(Station new_station) {
    cout << "-----------------------------------------------------------------------------------------------------------------------" << endl;
    cout << "Информация о вашей трубе:" << endl;
    cout << "-----------------------------------------------------------------------------------------------------------------------" << endl;
    sleep_for(seconds(1));
    if (new_station.station_name == "Nothing") {
        cout << "Отсутствуют..." << endl;
    }
    else {
        cout << "Имя: " << new_station.station_name << endl;
        cout << "Количество цехов: " << new_station.station_workshops << " штук." << endl;
        cout << "Количество рабочих цехов: " << new_station.station_working_workshops << " штук." << endl;
        cout << "Эффективность: " << new_station.station_efficiency << endl;
        sleep_for(seconds(1));
        cout << "-----------------------------------------------------------------------------------------------------------------------" << endl;
    }
}
//-------------------------------------------------------------------------------------------------------------------------

void editing_a_pipe() { //4. Редактировать трубу 
    cout << "Hello!" << endl;
    cout << "I am a sample function";
}
//-------------------------------------------------------------------------------------------------------------------------

void editing_the_compressor_station() { //5. Редактировать КС 
    cout << "Hello!" << endl;
    cout << "I am a sample function";
}
//-------------------------------------------------------------------------------------------------------------------------

void saving_data() { //6. Сохранить 
    cout << "Hello!" << endl;
    cout << "I am a sample function";
}
//-------------------------------------------------------------------------------------------------------------------------

void uploading_data() { //7. Загрузить 
    cout << "Hello!" << endl;
    cout << "I am a sample function";
}
//-------------------------------------------------------------------------------------------------------------------------

void exiting_the_program() { //0. Выход
    cout << "the end";
    exit(0);

}


//-------------------------------------------------------------------------------------------------------------------------
//-------------------------------------------------------------------------------------------------------------------------
//-------------------------------------------------------------------------------------------------------------------------

int main()
{
    setlocale(LC_ALL, "Russian"); // Без него консоль не поймёт русский язык и вместо обычного текста выведет набор несвязанных символов
    cout << "Здравствуйте. Добро пожаловать в меню по созданию и редактированию  трубы и КС или НПС!" <<endl;
    sleep_for(seconds(3)); // Задержка на 3 секунды. Исключительно для оформления.
    Pipe pipe0;
    Station station0;
    int number = 0;
    while (true)
    {
    cout << "Пожалуйста, выберите режим и напишите соответствующую цифру:" << endl;
    cout << "1. Добавить трубу;  " << endl;
    cout << "2. Добавить КС;" << endl;
    cout << "3. Просмотр всех объектов; " << endl;
    cout << "4. Редактировать трубу; " << endl;
    cout << "5. Редактировать КС; " << endl;
    cout << "6. Сохранить; " << endl;
    cout << "7. Загрузить; " << endl;
    cout << "8. Выход." << endl;
    cin >> number;


    switch (number)
    {
    case 1:
    {
        pipe0 = Adding_a_pipe();
        pipe_info(pipe0);
        break;
    }
    case 2:
    {
        station0 = Adding_a_compressor_station();
        station_info(station0);
        break;
    }
    case 3:
    {
        pipe_info(pipe0);
        station_info(station0);
        break;
    }
    case 4:
    {
        editing_a_pipe();
        break;
    }
    case 5:
    {
        editing_the_compressor_station();
        break;
    }

    case 6: 
    {
        saving_data();
        break;
    }
    case 7: 
    {
        uploading_data();
        break;
    }

    case 8:
    {
        exiting_the_program();
        break;
    }

    default:
    {
        cout << "К сожалению, произошла ошибка, перезапустите программу...";
        sleep_for(seconds(1));
        exit(0);
    }

    }

    }
    return 0;
}

/*При запуске программы выводится меню, запрашивающее в бесконечном цикле действие от пользователя.Пример меню: 
1. Добавить трубу 
2. Добавить КС 
3. Просмотр всех объектов 
4. Редактировать трубу 
5. Редактировать КС 
6. Сохранить 
7. Загрузить 
0. Выход*/